PetSafeKennels/app/controllers/customers_controller.rb

  def admin
    @customers = Customer.all
    @associatedInfo = @customers.map{ |cus| {customer: cus, kennel: cus.kennels} }
---
SELECT "customers".* FROM "customers"
SELECT "kennels".* FROM "kennels" WHERE "kennels"."customer_id" = $1  [["customer_id", 6]]